# Module 8: Exploring Data 

After importing data, you should take the time to review the data you are working with. This includes: determining the properties of the dataset, the number of rows and columns, the names of all the columns, and what information your dataset contains.

In [48]:
## always start with importing the libraries you need! ## 

import pandas as pd

## new library ##

import numpy as np

## Importing Excel Data

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [15]:
## similar process with slightly different code

df = pd.read_excel("axisdata.xlsx")

df.head()

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jackie,Jackson,Trainee,F,32,Y,1,3
1,Mary,Patterson,Trainee,F,43,N,1,6
2,Tanya,Adams,Trainee,F,28,Y,1,2
3,Tanya,Henderson,Trainee,F,24,Y,1,5
4,Walter,Franklin,Trainee,M,25,Y,1,4

## Types of Variables (Columns)
    
Categorical variables are comprised of category or label values; these variables place individuals into one of several groups. Examples:

- Marital Status (married, single, divorced)
- Eye Color (brown, blue, green)
- Level of Education (elementary, high school, college)
    
Quantitative variables are comprised of numerical values and represent some kind of measurement. Examples:

- Height
- Age
- Income

In [1]:
df.head(2)

## which variables are categorical and which are numeric?

NameError: name 'df' is not defined

## Dataset Characteristics

In [8]:
## return a list of all dataset column names 

df.columns

Index(['Fname', 'Lname', 'Position', 'Gender', 'Hours Worked', 'SalesTraining',
       'Years Experience', 'Cars Sold'],
      dtype='object')

In [7]:
## return a list of all column names and the data type of each column

df.dtypes

Fname               object
Lname               object
Position            object
Gender              object
Hours Worked         int64
SalesTraining       object
Years Experience     int64
Cars Sold            int64
dtype: object

In [6]:
## return the number of columns and rows in the dataset

df.shape

(999, 8)

In [9]:
## preview the first 5 rows

df.head()

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jackie,Jackson,Trainee,F,32,Y,1,3
1,Mary,Patterson,Trainee,F,43,N,1,6
2,Tanya,Adams,Trainee,F,28,Y,1,2
3,Tanya,Henderson,Trainee,F,24,Y,1,5
4,Walter,Franklin,Trainee,M,25,Y,1,4

In [10]:
## preview the last 5 rows

df.tail()

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
994,Walter,Mulgrew,Senior Salesperson,M,40,Y,5,5
995,Veronica,Looner,Senior Salesperson,F,22,Y,5,4
996,Larry,Patterson,Senior Salesperson,M,29,N,5,3
997,Victor,Kane,Senior Salesperson,M,22,Y,5,4
998,Victoria,Rogers,Senior Salesperson,F,29,N,5,1

In [11]:
## return a summary of the dataset

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Fname             999 non-null    object
 1   Lname             999 non-null    object
 2   Position          999 non-null    object
 3   Gender            999 non-null    object
 4   Hours Worked      999 non-null    int64
 5   SalesTraining     999 non-null    object
 6   Years Experience  999 non-null    int64
 7   Cars Sold         999 non-null    int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [12]:
## return a summary of the numeric variables in dataset

df.describe()

       Hours Worked  Years Experience   Cars Sold
count    999.000000        999.000000  999.000000
mean      33.727728          3.026026    3.922923
std        8.223454          1.394709    1.527000
min       20.000000          1.000000    1.000000
25%       27.000000          2.000000    3.000000
50%       34.000000          3.000000    4.000000
75%       41.000000          4.000000    5.000000
max       48.000000          5.000000    7.000000

## { EXERCISE 1 }

1. Import the pokemon.csv file. Nickname the file "pk" and preview the first 5 rows.
2. Write the code to see the summary of the dataset.
3. Write the code to see the descriptive summary for the numeric variables in the dataset.

In [3]:
import pandas as pd

In [49]:
pk = pd.read_csv ("pokemon.csv")

In [8]:
pk.head()

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,2,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False

In [10]:
pk.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151 entries, 0 to 150
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Num        151 non-null    int64
 1   Name       151 non-null    object
 2   Type 1     151 non-null    object
 3   Type 2     67 non-null     object
 4   Total      151 non-null    int64
 5   HP         151 non-null    int64
 6   Attack     151 non-null    int64
 7   Defense    151 non-null    int64
 8   SpAtk      151 non-null    int64
 9   SpDef      151 non-null    int64
 10  Speed      151 non-null    int64
 11  Stage      151 non-null    int64
 12  Legendary  151 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 14.4+ KB

In [11]:
pk.describe()

,Num,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage
count,151.000000,151.00000,151.000000,151.000000,151.000000,151.000000,151.000000,151.000000,151.000000
mean,76.000000,407.07947,64.211921,72.549669,68.225166,67.139073,66.019868,68.933775,1.582781
std,43.734045,99.74384,28.590117,26.596162,26.916704,28.534199,24.197926,26.746880,0.676832
min,1.000000,195.00000,10.000000,5.000000,5.000000,15.000000,20.000000,15.000000,1.000000
25%,38.500000,320.00000,45.000000,51.000000,50.000000,45.000000,49.000000,46.500000,1.000000
50%,76.000000,405.00000,60.000000,70.000000,65.000000,65.000000,65.000000,70.000000,1.000000
75%,113.500000,490.00000,80.000000,90.000000,84.000000,87.500000,80.000000,90.000000,2.000000
max,151.000000,680.00000,250.000000,134.000000,180.000000,154.000000,125.000000,140.000000,3.000000

## Simple Descriptive Statistics

Descriptive statistics are used to describe a dataset. We will cover descriptive statistics in more detail later on, but there are a few simple statistics you can familiarize yourself with now.

In [13]:
# shows the maximum value of all columns

pk.max()

C:\Users\RVHU32~1\AppData\Local\Temp/ipykernel_3812/94582300.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pk.max()

Num            151
Name         Zubat
Type 1       Water
Total          680
HP             250
Attack         134
Defense        180
SpAtk          154
SpDef          125
Speed          140
Stage            3
Legendary     True
dtype: object

In [16]:
#shows the maximum value of all columns

df.max()

Fname                 india
Lname               Withers
Position            Trainee
Gender                    M
Hours Worked             48
SalesTraining             Y
Years Experience          5
Cars Sold                 7
dtype: object

In [ ]:
# shows the maximum value of the Hours Worked column

df["Hours Worked"].max()

# maximum value of the another names column

In [23]:
# shows the minimum value of the Hours worked column

df["Hours Worked"].min()

20

In [19]:
# shows the maximum value of all columns

df.max()

Fname                 india
Lname               Withers
Position            Trainee
Gender                    M
Hours Worked             48
SalesTraining             Y
Years Experience          5
Cars Sold                 7
dtype: object

In [20]:
# shows the minimum value of the Hours Worked column

df["Hours Worked"].min()

20

In [21]:
# shows the sum of all values in the Hours Worked column

df["Hours Worked"].sum()

33694

In [18]:
# shows the average value of all columns

df.mean()

C:\Users\RVHU32~1\AppData\Local\Temp/ipykernel_3812/2896402753.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Hours Worked        33.727728
Years Experience     3.026026
Cars Sold            3.922923
dtype: float64

In [22]:
# shows the average value of the Hours Worked column

df["Hours Worked"].mean()

33.727727727727725

In [24]:
# shows the median value of all numeric columns
# the median is the central value when all values are in order of least to greatest

df.median()

C:\Users\RVHU32~1\AppData\Local\Temp/ipykernel_3812/497686202.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Hours Worked        34.0
Years Experience     3.0
Cars Sold            4.0
dtype: float64

In [25]:
# shows the median value of the Hours Worked column  #median is the middle number

df["Hours Worked"].median()

34.0

In [26]:
# shows the mode of all numeric columns
#  the mode is the value or values that occur the most frequently in the dataset, 
# there can be no mode if all values occur the same number of times

df.mode()

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Sam,Johnson,Junior Salesperson,M,38,Y,3,5

In [27]:
# shows the mode value of the Hours Worked column
#mode shows up most often, so there can be two modes, here it is 0 and 38 hours

df["Hours Worked"].mode()

0    38
dtype: int64

## Value Frequencies

Value counts/freq show how many individuals fall into a specific category. This is how we will explore our categorical variables.

In [28]:
df["Position"].value_counts()

Junior Salesperson    419
Senior Salesperson    397
Trainee               183
Name: Position, dtype: int64

In [29]:
df["Gender"].value_counts()

M    510
F    489
Name: Gender, dtype: int64

In [30]:
df["SalesTraining"].value_counts()

Y    586
N    413
Name: SalesTraining, dtype: int64

In [31]:
df["SalesTraining"].value_counts(normalize = True)

Y    0.586587
N    0.413413
Name: SalesTraining, dtype: float64

## { EXERCISE 2 }

1. Using the "pk" dataset you previously imported, determine the following information for the DEFENSE column:
    * Mean defense value
    * Min defense value
    * Max defense value
    * Sum defense value
    
    
2. Use the value counts function to determine how many pokemon fall into each of the following categories:
    * Type 1
    * Type 2
    * Stage
    * Legendary

In [32]:
pk.mean()

C:\Users\RVHU32~1\AppData\Local\Temp/ipykernel_3812/2806586578.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pk.mean()

Num           76.000000
Total        407.079470
HP            64.211921
Attack        72.549669
Defense       68.225166
SpAtk         67.139073
SpDef         66.019868
Speed         68.933775
Stage          1.582781
Legendary      0.026490
dtype: float64

In [33]:
pk.min()

C:\Users\RVHU32~1\AppData\Local\Temp/ipykernel_3812/1137132924.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pk.min()

Num              1
Name          Abra
Type 1         Bug
Total          195
HP              10
Attack           5
Defense          5
SpAtk           15
SpDef           20
Speed           15
Stage            1
Legendary    False
dtype: object

In [34]:
pk.max()

C:\Users\RVHU32~1\AppData\Local\Temp/ipykernel_3812/3224631094.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pk.max()

Num            151
Name         Zubat
Type 1       Water
Total          680
HP             250
Attack         134
Defense        180
SpAtk          154
SpDef          125
Speed          140
Stage            3
Legendary     True
dtype: object

In [35]:
pk.sum()

C:\Users\RVHU32~1\AppData\Local\Temp/ipykernel_3812/1087121693.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pk.sum()

Num                                                      11476
Name         BulbasaurIvysaurVenusaurCharmanderCharmeleonCh...
Type 1       GrassGrassGrassFireFireFireWaterWaterWaterBugB...
Total                                                    61469
HP                                                        9696
Attack                                                   10955
Defense                                                  10302
SpAtk                                                    10138
SpDef                                                     9969
Speed                                                    10409
Stage                                                      239
Legendary                                                    4
dtype: object

In [37]:
# Use the value counts function to determine how many pokemon fall into each of the following categories:
# Type 1
# Type 2
# Stage
# Legendary

pk.sum [["Type 1", "Type 2", "Stage", "Legendary"]]

TypeError: 'method' object is not subscriptable

In [38]:
pk ["Type 1"].value_counts()

Water       28
Normal      22
Poison      14
Grass       12
Fire        12
Bug         12
Electric     9
Rock         9
Ground       8
Psychic      8
Fighting     7
Ghost        3
Dragon       3
Fairy        2
Ice          2
Name: Type 1, dtype: int64

In [39]:
pk ["Type 2"].value_counts()

Poison      19
Flying      19
Ground       6
Psychic      6
Water        4
Fairy        3
Ice          3
Grass        2
Steel        2
Rock         2
Fighting     1
Name: Type 2, dtype: int64

In [40]:
pk ["Stage"].value_counts()

1    79
2    56
3    16
Name: Stage, dtype: int64

In [41]:
pk ["Legendary"].value_counts()

False    147
True       4
Name: Legendary, dtype: int64

## Locating Data based on a Condition

You can use the .loc method to locate specific data within your dataset based on a specific condition of the data. When exploring data based on a condition, keep in mind the conditional statements that we discussed previously:

#### Conditional Symbols

    == (equal to)
    != (not equal to)
    > (greater than)
    < (less than)
    >= (greater than or equal to)
    <= (less than or equal to)
    & (and)
    | (or)

In [43]:
## gender is Male

df.loc[df["Gender"] == "M"]

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
4,Walter,Franklin,Trainee,M,25,Y,1,4
6,Martin,Ettienne,Trainee,M,42,N,1,6
7,Peter,Michaels,Trainee,M,43,N,1,6
9,Walter,Moore,Trainee,M,32,Y,1,3
10,Sam,Michaels,Trainee,M,45,Y,1,3
...,...,...,...,...,...,...,...,...
991,Adam,Turner,Senior Salesperson,M,39,Y,5,3
993,Walter,Martins,Senior Salesperson,M,41,N,5,3
994,Walter,Mulgrew,Senior Salesperson,M,40,Y,5,5
996,Larry,Patterson,Senior Salesperson,M,29,N,5,3
997,Victor,Kane,Senior Salesperson,M,22,Y,5,4

In [ ]:
## hours worked is 40

df.loc[df["Hours Worked"] == 40]

In [ ]:
## years experience is less than 2

df.loc[df["Years Experience"] < 2]

In [ ]:
## cars sold is greater than or equal to 3

df.loc[df["Cars Sold"] >= 3]

In [ ]:
## gender does not equal Male

df.loc[df["Gender"] != "M"]

## Locating Data Based on Multiple Conditions

You can also have the option of choosing multiple conditions to sift through your data. When using multiple conditions, pay attention to how the conditions relate to each other (i.e. do you want to see data where both conditions are true? do you want to see data where at least one condition is true?) - this is where you will need to implement the <b>and (&)</b> and <b>or (|)</b> options.

In [ ]:
## locate data where the individuals have no sales experience and sold over 4 cars

df.loc[(df["SalesTraining"] == "N") & (df["Cars Sold"] > 4)]

In [ ]:
## locate the data where years of experience is 1 or hours worked is less than 25

df.loc[(df["Years Experience"] == 1) | (df["Hours Worked"] < 25)]

In [ ]:
## adding in a third condition

df.loc[(df["SalesTraining"] == "N") & (df["Cars Sold"] > 4) & (df["Gender"] == "F")]

## { EXERCISE 3 }

1. Using the "pk" dataset, locate the data where STAGE is 1.
2. Using the "pk" dataset, locate the data where TYPE 1 is Fire.
3. Using the "pk" dataset, locate the data where SPEED is greater than 65.
4. Using the "pk" dataset, locate the data that meets the following conditions:
    * ATTACK is less than 60
    * STAGE is equal to 2
5. Using the "pk" dataset, locate the data that meets the following conditions:
    * TYPE 1 is equal to "Bug"
    * SPEED is greater than or equal to 50

In [52]:
import pandas as pd

In [58]:
pk = pd.read_csv("pokemon.csv")

In [59]:
pk.head()

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,2,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False

In [60]:
pk.loc[pk["Stage"] == 1]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
6,7,Squirtle,Water,NaN,314,44,48,65,50,64,43,1,False
9,10,Caterpie,Bug,NaN,195,45,30,35,20,20,45,1,False
12,13,Weedle,Bug,Poison,195,40,35,30,20,20,50,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
144,145,Zapdos,Electric,Flying,580,90,90,85,125,90,100,1,True
145,146,Moltres,Fire,Flying,580,90,100,90,125,85,90,1,True
146,147,Dratini,Dragon,NaN,300,41,64,45,50,50,50,1,False
149,150,Mewtwo,Psychic,NaN,680,106,110,90,154,90,130,1,True
150,151,Mew,Psychic,NaN,600,100,100,100,100,100,100,1,False

In [61]:
# Using the "pk" dataset, locate the data where TYPE 1 is Fire

pk.loc[pk["Type 1"] == "Fire"]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False
5,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,3,False
36,37,Vulpix,Fire,NaN,299,38,41,40,50,65,65,1,False
37,38,Ninetales,Fire,NaN,505,73,76,75,81,100,100,2,False
57,58,Growlithe,Fire,NaN,350,55,70,45,70,50,60,1,False
58,59,Arcanine,Fire,NaN,555,90,110,80,100,80,95,2,False
76,77,Ponyta,Fire,NaN,410,50,85,55,65,65,90,1,False
77,78,Rapidash,Fire,NaN,500,65,100,70,80,80,105,2,False
125,126,Magmar,Fire,NaN,495,65,95,57,100,85,93,1,False
135,136,Flareon,Fire,NaN,525,65,130,60,95,110,65,2,False
145,146,Moltres,Fire,Flying,580,90,100,90,125,85,90,1,True

In [62]:
# Using the "pk" dataset, locate the data where SPEED is greater than 65.

pk.loc[pk["Speed"] > 65]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False
5,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,3,False
8,9,Blastoise,Water,NaN,530,79,83,100,85,105,78,3,False
11,12,Butterfree,Bug,Flying,395,60,45,50,90,80,70,3,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145,146,Moltres,Fire,Flying,580,90,100,90,125,85,90,1,True
147,148,Dragonair,Dragon,NaN,420,61,84,65,70,70,70,2,False
148,149,Dragonite,Dragon,Flying,600,91,134,95,100,100,80,3,False
149,150,Mewtwo,Psychic,NaN,680,106,110,90,154,90,130,1,True
150,151,Mew,Psychic,NaN,600,100,100,100,100,100,100,1,False

In [68]:
# Using the "pk" dataset, locate the data that meets the following conditions:
# ATTACK is less than 60
# STAGE is equal to 2

# df.loc[(df["Years Experience"] == 1) | (df["Hours Worked"] < 25)]

pk.loc[(pk["Attack" < "60"] & ["Stage" == 2)]

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' (Temp/ipykernel_3812/2356169663.py, line 7)

In [89]:
pk.loc[(pk["Attack"] < 60) & (pk["Stage"] == 2)]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
10,11,Metapod,Bug,NaN,205,50,20,55,25,25,30,2,False
13,14,Kakuna,Bug,Poison,205,45,25,50,25,25,35,2,False
63,64,Kadabra,Psychic,NaN,400,40,35,30,120,70,105,2,False
92,93,Haunter,Ghost,Poison,405,45,50,45,115,55,95,2,False
100,101,Electrode,Electric,NaN,480,60,50,70,80,80,140,2,False

In [95]:
# Using the "pk" dataset, locate the data that meets the following conditions:
#TYPE 1 is equal to "Bug"
#SPEED is greater than or equal to 50

pk.loc[(pk["Type 1"] == "Bug") & (pk["Speed"] >= 50)]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
11,12,Butterfree,Bug,Flying,395,60,45,50,90,80,70,3,False
12,13,Weedle,Bug,Poison,195,40,35,30,20,20,50,1,False
14,15,Beedrill,Bug,Poison,395,65,90,40,45,80,75,3,False
48,49,Venomoth,Bug,Poison,450,70,65,60,90,75,90,2,False
122,123,Scyther,Bug,Flying,500,70,110,80,55,80,105,1,False
126,127,Pinsir,Bug,NaN,500,65,125,100,55,70,85,1,False

## Crosstabs
    
To describe a single categorical variable, we use frequency tables (see above for value counts). To observe the relationship between two categorical variables, we use a cross-tabulation table (crosstab). With a crosstab, you can determine the frequency of observations across categories.

In [69]:
pd.crosstab(df["Position"], df["Gender"])

Gender                F    M
Position
Junior Salesperson  204  215
Senior Salesperson  200  197
Trainee              85   98

In [70]:
pd.crosstab(df["Position"], df["Gender"], margins=True)

Gender                F    M  All
Position
Junior Salesperson  204  215  419
Senior Salesperson  200  197  397
Trainee              85   98  183
All                 489  510  999

## Grouping Data

Grouping data allows you to summarize data in different ways, this may give you insight on how some variables interact with others. Using the groupby function, you will select a numeric variable to be summarized and then a categorical variable to group the numeric variable.    
    
    df[numeric variable].groupby(categorical variable).summarizing element

In [71]:
## Group by Sales Training; Summarize for Cars Sold

df["Cars Sold"].groupby(df["SalesTraining"]).mean()

SalesTraining
N    3.573850
Y    4.168942
Name: Cars Sold, dtype: float64

In [72]:
## Group by Gender; Summarize for Cars Sold

df["Cars Sold"].groupby(df["Gender"]).mean()

Gender
F    3.760736
M    4.078431
Name: Cars Sold, dtype: float64

In [73]:
## Group by Position; Summarize for Hours Worked

df["Hours Worked"].groupby(df["Position"]).mean()

Position
Junior Salesperson    34.066826
Senior Salesperson    33.692695
Trainee               33.027322
Name: Hours Worked, dtype: float64

In [74]:
## Grouping the entire dataset by a specific variable

df.groupby(df['SalesTraining']).mean()

               Hours Worked  Years Experience  Cars Sold
SalesTraining
N                 33.474576          3.055690   3.573850
Y                 33.906143          3.005119   4.168942

## { EXERCISE 4 }

1. Using the "pk" dataset, group your ATTACK variable by STAGE. Summarize this data by showing the mean attack across each stage.
2. Using the "pk" dataset, group your SPEED variable by TYPE 1. Summarize this data by showing the mean speed across each pokemon type. 
3. Using the "pk" dataset, group your DEFENSE variable by STAGE. Summarize this data by showing the mean defense across each stage.

In [97]:
pk["Attack"].groupby(pk["Stage"]).mean()

Stage
1    63.696203
2    80.107143
3    89.812500
Name: Attack, dtype: float64

In [99]:
pk["Speed"].groupby(pk["Type 1"]).mean()

Type 1
Bug         57.083333
Dragon      66.666667
Electric    98.888889
Fairy       47.500000
Fighting    66.142857
Fire        84.000000
Ghost       95.000000
Grass       52.083333
Ground      58.125000
Ice         90.000000
Normal      69.318182
Poison      58.785714
Psychic     93.000000
Rock        58.333333
Water       67.714286
Name: Speed, dtype: float64

In [100]:
# Using the "pk" dataset, group your DEFENSE variable by STAGE. 
# Summarize this data by showing the mean defense across each stage.

pk["Defense"].groupby(pk["Stage"]).mean()

Stage
1    60.797468
2    75.964286
3    77.812500
Name: Defense, dtype: float64

# { Module 8 Homework }

1. Import the "Dental Patients.xlsx" file and nickname the dataset "df". Preview the first 10 rows. You need to complete this step to have access to the correct dataset!

2. Write the code to preview the last 5 rows of the df dataset.

3. Write the code to print the summary information for the df dataset. How many rows are there? How many columns?

4. Looking closer at the df dataset, what is the maximum age for this group of patients? What is the minimum age?

5. How much money is owned in total to the dental practice? Hint: find the sum of the "OutstandingBalance" column.

6. Write the code below to determine how many new patients there are.

7. Write the code below to determine how many patients have any allergies.

8. Let's select some data based on conditions. Find the data in the df dataset where "Gender" equals "F".

9. Find the data in the df dataset where "OutstandingBalance" equals 0. These are the people who have paid all of their bills!

10. Complete the code below to find the data in the df dataset where "NewPatient" equals "Y" and "Allergies" also equals "Y".

11. Using the groupby function, group the df dataset by the "Insurance" variable and summarize for the "OutstandingBalance" variable. Use the mean.

12. Using the groupby function, group the df dataset by the "Gender" variable and summarize for the "Age" variable. Use the mean.